In [66]:
import pandas as pd
import numpy as np
import random

df_punk=pd.read_csv ("data/punk-4101.csv")
df_transaction=pd.read_csv ("data/transaction-4101.csv")

In [67]:
df_punk.drop(columns=["Unnamed: 0"],inplace=True)
df_punk.rename(columns={'_id': 'id_punk','_type': 'type'}, inplace=True)

In [13]:
df_transaction.drop(columns=["Unnamed: 0"],inplace=True)

In [68]:
def put_id(col, col_id,df):
    name_id=col.lower()
    col_dict= {name_id:list(df[col].unique()),
         col_id:list(range(1,len(df[col].unique())+1))}
    df[col_id]=df[col].apply(lambda x:col_dict.get(col_id)[col_dict.get(name_id).index(x)])
    
    df_col=pd.DataFrame(col_dict) #to return!
    print(col)
    print(df_col.head())
    print("**********************************************************")
    return df_col

In [69]:
#punk
df_type=put_id("type","id_type",df_punk)
df_attr=put_id("attr","id_attr",df_punk)

df_punk_id=df_punk[["id_punk","id_type"]].groupby("id_punk").first().reset_index()
df_punk_attr=df_punk[["id_punk","id_attr"]]

type
     type  id_type
0  Female        1
1    Male        2
2  Zombie        3
3     Ape        4
4   Alien        5
**********************************************************
attr
               attr  id_attr
0  Green Eye Shadow        1
1           Earring        2
2        Blonde Bob        3
3             Smile        4
4            Mohawk        5
**********************************************************

In [87]:
#transaction
df_type_transaction=put_id("type_transaction","id_type_transaction",df_transaction)

type_transaction
  type_transaction  id_type_transaction
0             Bid                     1
1    Bid Withdrawn                    2
2            Sold                     3
3          Offered                    4
4         Transfer                    5
**********************************************************

In [ ]:
"type","id_type"

In [106]:
df_tr_user=pd.concat([df_transaction["from"],df_transaction["to"]],ignore_index=True).dropna()
df_tr_user=df_tr_user.unique()

In [ ]:
col_dict= {'usr':list(df_tr_user.unique()),
         'id_from':list(range(1,len(df[col].unique())+1))}
    df[col_id]=df[col].apply(lambda x:col_dict.get(col_id)[col_dict.get(name_id).index(x)])
    
    df_col=pd.DataFrame(col_dict) #to return!

In [107]:
df_tr_user

array(['0x2eb9b439ffb7dc587198e1534e465a6242192b24',
       '0xe73a1dbb41bd58945c5bdd0f30a721096e625ae9',
       '0x2e5e227280b1d5ee28500a9000296c112dc8efc5', ...,
       '0x7efe3ac6ec0ff5b6136766ac79a97c1e9d8fd585',
       '0xc34fa49d477170abbf8ce311c4af29725719554e',
       '0x3d4d19c6768e40030e86fad914e4e958394f24a2'], dtype=object)

In [89]:
df_type_transaction

  type_transaction  id_type_transaction
0             Bid                     1
1    Bid Withdrawn                    2
2            Sold                     3
3          Offered                    4
4         Transfer                    5
5          Claimed                    6
6  Offer Withdrawn                    7
7         (Unwrap)                    8
8           (Wrap)                    9
9            Bid *                   10

In [71]:
df_attr

                attr  id_attr
0   Green Eye Shadow        1
1            Earring        2
2         Blonde Bob        3
3              Smile        4
4             Mohawk        5
..               ...      ...
82       Orange Side       83
83       Wild Blonde       84
84        Buck Teeth       85
85           Top Hat       86
86      Medical Mask       87

[87 rows x 2 columns]

In [75]:
df_punk

       id_punk    type                attr  id_type  id_attr
0          0.0  Female    Green Eye Shadow        1        1
1          0.0  Female             Earring        1        2
2          0.0  Female          Blonde Bob        1        3
3          1.0    Male               Smile        2        4
4          1.0    Male              Mohawk        2        5
...        ...     ...                 ...      ...      ...
10589   4100.0  Female             Earring        1        2
10590   4100.0  Female     Clown Eyes Blue        1       16
10591   4101.0  Female                Mole        1       54
10592   4101.0  Female     Wild White Hair        1       14
10593   4101.0  Female  Horned Rim Glasses        1       38

[10594 rows x 5 columns]

In [82]:

df_punk_id

      id_punk  id_type
0         0.0        1
1         1.0        2
2         2.0        1
3         3.0        2
4         4.0        2
...       ...      ...
4090   4097.0        2
4091   4098.0        2
4092   4099.0        1
4093   4100.0        1
4094   4101.0        1

[4095 rows x 2 columns]

In [14]:
df_transaction

,id_punk,type_transaction,from,to,amount_dol,amount_ethereums,letter,date
0,0.0,Bid,0x2eb9b439ffb7dc587198e1534e465a6242192b24,NaN,"4,048",1,NaN,"Dec 25, 2021"
1,0.0,Bid Withdrawn,0xe73a1dbb41bd58945c5bdd0f30a721096e625ae9,NaN,1.26,321,M,"Sep 04, 2021"
2,0.0,Bid,0xe73a1dbb41bd58945c5bdd0f30a721096e625ae9,NaN,1.14,321,M,"Sep 01, 2021"
3,0.0,Bid Withdrawn,0x2e5e227280b1d5ee28500a9000296c112dc8efc5,NaN,1.11,320,M,"Sep 01, 2021"
4,0.0,Bid,0x2e5e227280b1d5ee28500a9000296c112dc8efc5,NaN,1.1,320,M,"Sep 01, 2021"
...,...,...,...,...,...,...,...,...
70486,4101.0,Offered,NaN,NaN,"9,517",8.0,NaN,"Jan 14, 2021"
70487,4101.0,Offer Withdrawn,NaN,NaN,NaN,NaN,NaN,"Jan 08, 2021"
70488,4101.0,Offered,NaN,NaN,"6,748",20.0,NaN,"Oct 08, 2020"
70489,4101.0,Transfer,0xc24f574d6853f6f6a31c19d468a8c1b3f31c0e54,0x8bb4f3be31bc5aac56c75a41522b1e0d517aabc0,NaN,NaN,NaN,"Jun 26, 2017"
70490,4101.0,Claimed,NaN,0xc24f574d6853f6f6a31c19d468a8c1b3f31c0e54,NaN,NaN,NaN,"Jun 23, 2017"

In [30]:
df_attr

                attr  id
0   Green Eye Shadow   1
1            Earring   2
2         Blonde Bob   3
3              Smile   4
4             Mohawk   5
..               ...  ..
82       Orange Side  83
83       Wild Blonde  84
84        Buck Teeth  85
85           Top Hat  86
86      Medical Mask  87

[87 rows x 2 columns]